[
    {
        "id": 1,
        "name": "Curso completo de Python 3 de la A a la Z - 2021 +50 horas",
        "shortDescription": "Aprende Python 3 como un profesional empezando por las bases hasta programar tus propios algoritmos o juegos completos",
        "requirements": [
            "No es necesario ningún tipo de conocimiento en programación. Este curso es realmente te enseñará a programar desde cero.",
            "Un ordenador con conexión a internet para poder descargar y ejecutar los notebooks de Python que te daremos durante el curso.",
            "Muchas ganas de aprender Python desde cero para seguir creciendo en las ramas de Inteligencia Artificial, Data Science y Machine Learning."
        ],
        "longDescription": "¡Conviértete hoy mismo en un programador de Python y aprende una de las habilidades más solicitadas por las empresas que buscan empleados bien cualificados en este 2021!\nLos Data Scientist ganan en promedio más de $100,000 USD al año ya sea trabajando en empresas o como consultores externos. Sus portfolios de trabajos previos son su mejor arma para captar nuevos clientes y destacar como analistas de datos. Sin embargo, los datos no se analizan a mano, y el lenguaje de programación de Python se ha convertido en un requisito indispensable para aplicar algoritmos de Machine Learning o de Inteligencia Artificial como los que vemos en los cursos más avanzados. La programación con Python 3 se ha convertido en una habilidad importantísima para conseguir mejores trabajos en el siglo XXI.\n¡Este es el curso más completo, pero manteniendo la simplicidad para que aprender una tecnología como Python sea accesible para todos los estudiantes, para el lenguaje de programación Python en Keep Learning!. Ya sea que nunca hayas programado antes, o bien ya conozcas la sintaxis básica o tal vez quieras aprender sobre las funciones avanzadas de Python, ¡este curso es sin duda para ti! En este curso te enseñaremos Python 3 desde lo más básico hasta convertirte en un experto capaz de programar lo que quieras.",
        "image": "https://i.ibb.co/HY74rTy/python-Course.jpg",
        "price": [
            249,
            "MXN"
        ],
        "courseRating": 4.8,
        "totalReviews": 99000,
        "enrolledStudents": 4200,
        "reviews": [
            {
                "reviewerName": "Juan Fernando Rodríguez Ramírez",
                "reviewContent": "La verdad muy buen curso el instructor se nota que tiene muy buen dominio del tema, yo era una persona que nunca había usado Python y sé que ahora tengo las bases para manejar esta tecnología y defenderme a nivel laboral.\nLo MALO del curso es que la mayoría de las preguntas que realice nunca me las respondieron por eso no coloco las 5 estrellas y ojala resuelvan este inconveniente.",
                "reviewerPhoto": "https://i.ibb.co/9pTy0Q6/Reviewer-Photo.jpg",
                "reviewGrade": 4.5
            },
            {
                "reviewerName": "Alondra López Corrales",
                "reviewContent": "En general es buen curso, sin embargo el ejemplo de los superhéroes para explicar el curso no me parece profesional, teniendo el instructor tanta experiencia pudiera mejorar y poner ejemplos más reales y aplicables",
                "reviewerPhoto": "https://i.ibb.co/N93NJwc/profile-42914-960-720.png",
                "reviewGrade": 4.6
            }
        ]
    },
    {
        "id": 2,
        "name": "Aprende React + Firebase | 2021 Actualizado",
        "shortDescription": "JavaScript + React + Firebase todo lo que necesitas saber",
        "requirements": [
            "El unico requisito es tener muchas ganas de aprender da igual si no sabes JavaScript en el curso tendras los conceptos básicos."
        ],
        "longDescription": "En este curso aprenderás todo lo necesario para poder encontrar tu primer trabajo dentro del mundo TI JavaScript. \nAprenderás todo lo necesario en JavaScript para poder adentrarte en el mundo de la programación con sus librerías y frameworks.\nTambién aprenderás todo lo necesario sobre react y como se puede llevar esta librería a otro nivel.\nPor ultimo y como toque final aprenderás Firebase el servicio de Google en la nube para gestión de usuarios, data y mucho mas.",
        "image": "https://i.ibb.co/7n5dnCq/react-Course.jpg",
        "price": [
            7.99,
            "USD"
        ],
        "courseRating": 4.6,
        "totalReviews": 251,
        "enrolledStudents": 396,
        "reviews": [
            {
                "reviewerName": "Ana Romero Sánchez",
                "reviewContent": "Mi primer acercamiento a la programación y le he entendido perfectamente, muy bien explicado los temas.",
                "reviewerPhoto": "https://i.ibb.co/J324VcL/Photo-of-satisfied-brunette-woman-with-dark-hair-has-pleasant-smile-being-in-good-mood-wears-red-cas.jpg",
                "reviewGrade": 5
            },
            {
                "reviewerName": "René López Gallegos",
                "reviewContent": "Este curso deja mucho que desear está un poco desactualizado",
                "reviewerPhoto": "https://i.ibb.co/N93NJwc/profile-42914-960-720.png",
                "reviewGrade": 3.4
            }
        ]
    },
    {
        "id": 3,
        "name": "Curso de PowerBI para principiantes",
        "shortDescription": "Aprende a usar PowerBi para hacer dashboards",
        "requirements": [
            "Conocimientos básicos de excel"
        ],
        "longDescription": "En este curso de Power BI en español vas a aprender como hacer informes y reportes con dashboards en distintos proyectos, ejercicios y prácticas.",
        "image": "https://i.ibb.co/qB83zC9/proyecto2-2.png",
        "price": [
            10,
            "USD"
        ],
        "courseRating": 4.7,
        "totalReviews": 563,
        "enrolledStudents": 1206,
        "reviews": [
            {
                "reviewerName": "Veronica Figueroa Robledo",
                "reviewContent": "Excelente curso, muy bien explicado todo",
                "reviewerPhoto": "https://i.ibb.co/MNn65q3/woman-icon-for-user-profile-female-icon-human-or-people-sign-and-symbol-free-vector.jpg",
                "reviewGrade": 5
            },
            {
                "reviewerName": "Alfonso Cuellar Gamez",
                "reviewContent": "Me gustó mucho la forma en la que da las clases, buen curso",
                "reviewerPhoto": "https://i.ibb.co/N93NJwc/profile-42914-960-720.png",
                "reviewGrade": 4.8
            }
        ]
    },
    {
        "id": 4,
        "name": "Curso de Inteligencia Artificial con python",
        "shortDescription": "Combina el poder de los datos, Reinforcement Learning, Q-Learning y Deep Learning para crear IA en contextos reales",
        "requirements": [
            "Conocimientos medios de matemáticas, sobretodo de estadística y de álgebra lineal y avanzados del lenguaje de programación Python."
        ],
        "longDescription": "Bienvenido Curso completo de Inteligencia Artificial de cero a experto, donde aprenderás conceptos claves del mundo de la IAy el aprendizaje automatizado tanto desde el punto de visto teórico como implementaciones prácticas con Python.",
        "image": "https://i.ibb.co/qsD6b7T/artificial-intelligence.jpg",
        "price": [
            999,
            "MXN"
        ],
        "courseRating": 4.5,
        "totalReviews": 478,
        "enrolledStudents": 532,
        "reviews": [
            {
                "reviewerName": "Alan Torres Montemorelos",
                "reviewContent": "Bueno, realmente para el que no tiene experiencia alguna en Inteligencia Artificial, es un buen curso.",
                "reviewerPhoto": "https://i.ibb.co/xJ4890t/images.png",
                "reviewGrade": 4.9
            },
            {
                "reviewerName": "Fabian Garza Saucedo",
                "reviewContent": "Curso super-super completo, lleno de muchos temas y proyectos divertidos, recomendado casi diría yo obligado si te gusta y quieres seguir con este tema.",
                "reviewerPhoto": "https://i.ibb.co/N93NJwc/profile-42914-960-720.png",
                "reviewGrade": 5
            }
        ]
    }
]